logs/close_gap_nopad_run1.log
INFO 07-01 03:07:08 [nixl_utils.py:20] Setting UCX_RCACHE_MAX_UNRELEASED to '1024' to avoid a rare memory leak in UCX when using NIXL.
WARNING 07-01 03:07:08 [nixl_utils.py:34] NIXL is not available
WARNING 07-01 03:07:08 [nixl_utils.py:44] NIXL agent config is not available
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x726595520fe0>, trust_remote_code=False, seed=0, num_prompts=80, dataset_name='hf', no_stream=False, dataset_path='philschmid/mt-bench', no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url=None, host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=8, model='/data/hw3/Qwen3-8B-FP8-Dynamic', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-40c75586-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 8
100%|██████████| 80/80 [00:07<00:00, 10.02it/s]
Failed requests during benchmark run detected (capping to 10):
Error 0: Never received a valid chunk to calculate TTFT.This response will be marked as failed!
Error 1: Internal Server Error
Error 2: Internal Server Error
Error 3: Internal Server Error
Error 4: Internal Server Error
Error 5: Internal Server Error
Error 6: Internal Server Error
Error 7: Internal Server Error
Error 8: Internal Server Error
Error 9: Internal Server Error
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     10        
Failed requests:                         70        
Maximum request concurrency:             8         
Benchmark duration (s):                  7.98      
Total input tokens:                      865       
Total generated tokens:                  1972      
Request throughput (req/s):              1.25      
Output token throughput (tok/s):         246.98    
Peak output token throughput (tok/s):    822.00    
Peak concurrent requests:                10.00     
Total token throughput (tok/s):          355.32    
---------------Time to First Token----------------
Mean TTFT (ms):                          4524.26   
Median TTFT (ms):                        6377.53   
P99 TTFT (ms):                           6378.28   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          9.06      
Median TPOT (ms):                        6.30      
P99 TPOT (ms):                           27.28     
---------------Inter-token Latency----------------
Mean ITL (ms):                           13.02     
Median ITL (ms):                         8.74      
P99 ITL (ms):                            10.45     
==================================================